app/service/weather_service.rb

  def forecast_weather(location, hour, quantity)
    response = query_api(location, hour)

    unless quantity
      weather = create_current_weather(response)
      weather_saved = Weather
                        .where("location LIKE ?", "%#{location}%")
                        .where(date: weather.date)
                        .first

      if weather_saved
        fields_to_update = [:date, :temperature, :wind, :humidity, :condition, :url_img, :updated_at]
        update_values = weather.attributes.slice(*fields_to_update)
        update_values[:updated_at] = Time.now

        weather_saved.update(update_values)
      else
        weather.save!
---
UPDATE "weathers" SET "updated_at" = $1 WHERE "weathers"."id" = $2  [["updated_at", "2024-06-20 14:55:59.884260"], ["id", 5]]
UPDATE "weathers" SET "updated_at" = $1 WHERE "weathers"."id" = $2  [["updated_at", "2024-06-20 14:31:11.901243"], ["id", 1]]